rtreichl/msp430radio/Menu.c
void null_befor_value(char *string ,char value, unsigned char pos)
{
	if (value < 10)
	{
		string[pos++] = '0';
		string[pos  ] = 0x30 + value;
	}
	else
	{
		string[pos++] = 0x30 + value / 10;
		string[pos  ] = 0x30 + value % 10;
	}
}

void time_date(unsigned char t_hour, unsigned char t_minute, unsigned char t_day, unsigned char t_month, unsigned char t_year, unsigned char update, unsigned char minute_up, char *s_time, char *s_date)
{
	static unsigned char minute = 0, hour = 0, day= 1, month =  1, year = 14;
	unsigned char day_per_month[12] = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
	if(update)
	{
		hour = t_hour;
		minute = t_minute;

		day = t_day;
		month = t_month;
		year = t_year;
	}
	if(minute_up)
	{
		if(++minute == 60)
		{
			minute = 0;
			if(++hour == 24)
			{
				hour = 0;
				if(year%4 == 0 && month == 2)
				{
					day_per_month[1] = 29;
				}
				else
				{
					day_per_month[1] = 28;
				}
				if(day++ == day_per_month[month - 1])
				{
					day = 1;
					if(++month == 13)
					{
						month = 1;
						year++;
					}
				}
			}
		}
	}
	if(s_date != 0)
	{
		null_befor_value(s_date, day, 0);
		null_befor_value(s_date, month, 3);
		null_befor_value(s_date, year, 6);
	}
	if(s_time != 0)
	{
		null_befor_value(s_time, hour, 1);
		null_befor_value(s_time, minute, 4);
	}
}

char check_for_out_of_range(signed char value,char modulo)
{
	if(value < 0)
	{
		value = modulo - 1;
	}
	if(value == (127 - (127 % modulo)))
	{
		value = modulo;
	}
	return value;
}

void enter_standby(void)
{
	i2c_lcd_create_view("", 0, 0, 1);

	P3DIR |=  BIT1;
	P3OUT &=~ BIT1;

	P3DIR |=  BIT2;
	P3OUT &=~  BIT2;

	SI4735_Power_Down();


	_BIS_SR(LPM0_bits + GIE);

}

void exit_standby(void)
{

	Clock_INIT2();

	_delay_ms(500);
	//GPIO_INIT();

	P3DIR |=  BIT1;
	P3OUT |=  BIT1;

	P3DIR |=  BIT2;
	P3OUT |=  BIT2;

	_delay_ms(1);
	i2c_lcd_init();



	Amplifier_init(POP, 30);
	//AudioSwitch(0x05,0x01);


	// Init I2C Kommunikation übergebe Adresse des Slaves 0x11h und den Teiler für die Frequenz

	// Initialisiert den Radiochip
	SI4735_Power_Up();
	//SI4735_INIT();
	SI4735_Set_Volume(20);




}
